w4d3/app/views/cat_rental_requests/new.html.erb

    <option></option>
    <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"