w4d3/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @cat = Cat.find(params[:id])

INSERT INTO "cats" ("birth_date", "color", "created_at", "description", "name", "sex", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @cat = Cat.new(cat_params)
    @cat.user_id = current_user.id
    if @cat.save

SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @cat = Cat.find(params[:id])

SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "cats" SET "color" = $1, "updated_at" = $2 WHERE "cats"."id" = 2  [["color", "brown"], ["updated_at", "2015-07-15 22:30:32.267380"]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(cat_params)