w4d3/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."session_token" = 'aIO51FptYfnti-gvC_R7Og' LIMIT 1
---
  def destroy
    @user = User.find_by_session_token(session[:session_token])