w4d1/firstroutes/app/controllers/contacts_controller.rb

  def index
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 11]]

  def create
    @contact = Contact.new(contact_params)
    if @contact.save
---
INSERT INTO "contacts" ("name", "email", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "lol"], ["email", "google.com"], ["user_id", 12], ["created_at", "2015-07-13 23:41:12.379500"], ["updated_at", "2015-07-13 23:41:12.379500"]]

  def show
    @contact = Contact.find(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @contact = Contact.find(params[:id])
    if @contact.update(contact_params)
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "contacts" SET "name" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["name", "jeff"], ["updated_at", "2015-07-13 23:39:32.693442"], ["id", 2]]

  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 3]]