w4d1/firstroutes/app/controllers/users_controller.rb

  def index
    render json: User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "gizmo"], ["email", "gizmo@gmail.com"], ["created_at", "2015-07-13 21:26:18.312945"], ["updated_at", "2015-07-13 21:26:18.312945"]]

  def update
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "better_email"], ["updated_at", "2015-07-13 21:43:39.492551"], ["id", 6]]