w6d5/skeleton/app/views/tweets/_form.html.erb

      <option></option>
      <% User.all.each do |user| %>
---
SELECT "users".* FROM "users"