w7d1/skeleton1/app/controllers/toys_controller.rb

SELECT  "toys".* FROM "toys" WHERE "toys"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "toys" SET "pokemon_id" = $1, "updated_at" = $2 WHERE "toys"."id" = $3  [["pokemon_id", 2], ["updated_at", "2015-08-03 22:58:06.911579"], ["id", 1]]
---
  def update
    @toy = Toy.find(params[:id])
    if @toy.update_attributes(toy_params)