w5d1/GoalSetter/app/views/users/show.html.erb

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = ?  [["user_id", 2]]
---
  <table>
    <% @user.goals.each do |goal| %>