w5d1/GoalSetter/app/controllers/goals_controller.rb

INSERT INTO "goals" ("title", "visible", "completed", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "asdfadsf"], ["visible", "Public"], ["completed", "f"], ["user_id", 2], ["created_at", "2015-07-21 00:05:35.355945"], ["updated_at", "2015-07-21 00:05:35.355945"]]
---
  def create
    @goal = Goal.new(goal_params)
    @goal.completed = false
    @goal.user_id = current_user.id
    if @goal.save

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @goal = Goal.find_by_id(params[:id])

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "goals" SET "title" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["title", "this tests edit"], ["updated_at", "2015-07-21 00:09:43.472547"], ["id", 1]]
---
  def update
    @goal = Goal.find_by_id(params[:id])
    if @goal.update(goal_params)

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "goals" WHERE "goals"."id" = ?  [["id", 2]]
---
  def destroy
    @goal = Goal.find_by_id(params[:id])
    @goal.destroy

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "goals" SET "completed" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["completed", "t"], ["updated_at", "2015-07-21 00:11:42.478846"], ["id", 3]]
---
  def complete
    @goal = Goal.find_by_id(params[:id])
    @goal.update!(completed: true)